# LevelAssociationData Properties

---
The LevelAssociationData type exposes the following members.
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
Top
#### Reference
LevelAssociationData Class
Autodesk.Revit.DB Namespace